In [18]:
import numpy as np
import pandas as pd

In [19]:
date = pd.read_csv('orders.csv')
time = pd.read_csv('messages.csv')

In [20]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [21]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

### date date

In [22]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [23]:
date['date'] = pd.to_datetime(date['date'])

In [24]:
date.head(), date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

(        date  product_id  city_id  orders
 0 2019-12-10        5628       25       3
 1 2018-08-15        3646       14     157
 2 2018-10-23        1859       25       1
 3 2019-08-17        7292       25       1
 4 2019-01-06        4344       25       3,
 None)

In [25]:
date['year'] = date['date'].dt.year
date.sample(5)

          date  product_id  city_id  orders  year
979 2019-08-19        2426       22       1  2019
154 2018-10-10         803       23       2  2018
872 2019-08-12         393        3      85  2019
713 2018-10-14        4269       22       2  2018
765 2018-11-01        3913       13       7  2018

In [26]:
date['month'] = date['date'].dt.month
date['month name'] = date['date'].dt.month_name()

In [27]:
date['day'] = date['date'].dt.day
date.sample(5)

          date  product_id  city_id  orders  year  month month name  day
33  2019-07-11        3121       17       1  2019      7       July   11
621 2018-10-12        6011        9       4  2018     10    October   12
598 2018-09-07        1134       13      19  2018      9  September    7
624 2018-11-09        1737        1       8  2018     11   November    9
971 2019-04-17        1233       16      18  2019      4      April   17

In [29]:
date['date_dow'] = date['date'].dt.dayofweek
date['date_dow_name'] = date['date'].dt.day_name()

In [33]:
date.head(5)

,date,product_id,city_id,orders,year,month,month name,day,date_dow,date_dow_name
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday

In [37]:
date['date_is_weekend'] =(date['date'].dt.day_of_week > 5)

In [40]:
date.sample(2)

,date,product_id,city_id,orders,year,month,month name,day,date_dow,date_dow_name,date_is_weekend
815,2019-12-08,3659,20,4,2019,12,December,8,6,Sunday,True
466,2018-12-11,4203,22,26,2018,12,December,11,1,Tuesday,False

In [56]:
date['date_week'] = (np.ceil(date['date'].dt.day_of_year / 7)).astype(int)

In [57]:
date.head()

,date,product_id,city_id,orders,year,month,month name,day,date_dow,date_dow_name,date_is_weekend,date_week
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday,False,50
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday,False,33
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday,False,43
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday,False,33
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday,True,1

In [61]:
date['quarter'] = date['date'].dt.quarter
date['semester'] = np.where(date['quarter'].isin([1,2]), 1, 2)

In [62]:
date.head()

,date,product_id,city_id,orders,year,month,month name,day,date_dow,date_dow_name,date_is_weekend,date_week,quarter,semester
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday,False,50,4,2
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday,False,33,3,2
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday,False,43,4,2
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday,False,33,3,2
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday,True,1,1,1

In [63]:
import datetime

today = datetime.datetime.today()

today

datetime.datetime(2024, 7, 8, 10, 44, 27, 990738)

In [68]:
# time elapsed
today - date['date']

0     1672 days 10:44:27.990738
1     2154 days 10:44:27.990738
2     2085 days 10:44:27.990738
3     1787 days 10:44:27.990738
4     2010 days 10:44:27.990738
                 ...
995   2100 days 10:44:27.990738
996   2041 days 10:44:27.990738
997   1889 days 10:44:27.990738
998   1954 days 10:44:27.990738
999   1728 days 10:44:27.990738
Name: date, Length: 1000, dtype: timedelta64[ns]

In [76]:
# days passed
(today - date['date']).dt.days

0      1672
1      2154
2      2085
3      1787
4      2010
       ...
995    2100
996    2041
997    1889
998    1954
999    1728
Name: date, Length: 1000, dtype: int64

In [83]:
# month passed
(today - date['date']).dt.days // 12

0      139
1      179
2      173
3      148
4      167
      ...
995    175
996    170
997    157
998    162
999    144
Name: date, Length: 1000, dtype: int64

### time data

In [85]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [87]:
time['date'] = pd.to_datetime(time['date'])

In [88]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [90]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

In [93]:
time.head(2)

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00

In [92]:
time['time'] = time['date'].dt.time

In [98]:
today - time['date']

0     3858 days 09:54:27.990738
1     3722 days 11:04:27.990738
2     4208 days 10:23:27.990738
3     3510 days 10:13:27.990738
4     3907 days 11:33:27.990738
                 ...
995   4497 days 09:54:27.990738
996   3818 days 11:30:27.990738
997   4283 days 11:07:27.990738
998   4399 days 11:10:27.990738
999   3671 days 11:19:27.990738
Name: date, Length: 1000, dtype: timedelta64[ns]

In [112]:
# in seconds
(today - time['date'])/np.timedelta64(1, 's')

0      3.333669e+08
1      3.216207e+08
2      3.636086e+08
3      3.033008e+08
4      3.376064e+08
           ...
995    3.885765e+08
996    3.299166e+08
997    3.700912e+08
998    3.801138e+08
999    3.172152e+08
Name: date, Length: 1000, dtype: float64

In [113]:
# in minutes
(today - time['date'])/np.timedelta64(1, 'm')

0      5.556114e+06
1      5.360344e+06
2      6.060143e+06
3      5.055013e+06
4      5.626773e+06
           ...
995    6.476274e+06
996    5.498610e+06
997    6.168187e+06
998    6.335230e+06
999    5.286919e+06
Name: date, Length: 1000, dtype: float64

In [114]:
# in hours
(today - time['date'])/np.timedelta64(1, 'h')

0       92601.907775
1       89339.074442
2      101002.391109
3       84250.224442
4       93779.557775
           ...
995    107937.907775
996     91643.507775
997    102803.124442
998    105587.174442
999     88115.324442
Name: date, Length: 1000, dtype: float64